Revit 2026 API

# DesignToFabricationConverterResult Enumeration

---

Possible results from invoking the DesignToFabricationConverter.

**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum DesignToFabricationConverterResult
```
```vb
Public Enumeration DesignToFabricationConverterResult
```
```cpp
public enum class DesignToFabricationConverterResult
```
```fsharp
type DesignToFabricationConverterResult
```

| Member name | Value | Description |
| --- | --- | --- |
| PartialFailure | 1 | Conversion contained partial failures and will need to be fixed manually. |
| Success | 0 | Conversion was successful. |

#### Reference

Autodesk.Revit.DB.Fabrication Namespace